MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_Base/FlyRf_Base_26_04_22_11/WebRF.cpp
    String html;  // Параметр геометрии, координаты, размера или угла.
    html.reserve(900);
    html += F("<table style='width:100%;border-collapse:collapse;table-layout:fixed;'>");
    html += String("<tr><th class='left' style='width:54%;padding:2px 8px 2px 0;'>Профиль</th><td style='padding:2px 0;text-align:right;'>") + runtimeProfile + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>Частота</th><td style='padding:2px 0;text-align:right;'>") + String((double)info.frequencyHz / 1000000.0, 3) + String(" MHz</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>SF</th><td style='padding:2px 0;text-align:right;'>") + String(info.spreadingFactor) + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>BW</th><td style='padding:2px 0;text-align:right;'>") + String(info.bandwidthKHz) + String(" kHz</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>CR</th><td style='padding:2px 0;text-align:right;'>4/") + String(info.codingRateDenom) + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>SyncWord</th><td style='padding:2px 0;text-align:right;'>0x") + String(syncBuf) + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>RX symbols</th><td style='padding:2px 0;text-align:right;'>") + String(info.rxSymbols) + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>TX power</th><td style='padding:2px 0;text-align:right;'>") + String(info.txPowerDbm) + String(" dBm</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>LowDataRateOptimize</th><td style='padding:2px 0;text-align:right;'>") + (info.lowDataRateOptimize ? String("On") : String("Off")) + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>CRC payload</th><td style='padding:2px 0;text-align:right;'>") + (info.crcOnPayload ? String("On") : String("Off")) + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>Header mode</th><td style='padding:2px 0;text-align:right;'>") + (info.implicitHeader ? String("Implicit") : String("Explicit")) + String("</td></tr>");
    html += F("</table>");
    return html;
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static String loraRuntimeSourceText()
{
    return RF_GetLoraRegistersSourceText();
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные:
// - html: Параметр геометрии, координаты, размера или угла.
//------------------------------------------------------------------------------
static String loraRuntimeSettingsBlock(const char* titleHtml, bool centeredTitle = false)
{
    String html;  // Параметр геометрии, координаты, размера или угла.
    html.reserve(1400);
    html += F("<div class='settingsBlock'><div class='blockTitle");
    if (centeredTitle) html += F(" blockTitleCenter");
    html += F("'>");
    html += (titleHtml ? String(titleHtml) : String("LoRa / LMIC"));
    html += F("</div>");
    html += loraRuntimeModeText();
    html += F("<table><tr><th>Источник данных LMIC / LoRa</th><td>");
    html += loraRuntimeSourceText();
    html += F("</td></tr></table></div>");
    return html;
}

//------------------------------------------------------------------------------
// Назначение функции: Принимает и разбирает входные данные, преобразуя их во внутренний формат.
// Локальные переменные:
// - b: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - c: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - d: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
//------------------------------------------------------------------------------
static void parseIpArg(const String& name, uint8_t out[4])
{
    if (!server.hasArg(name) || out == nullptr) return;

    int a = 0, b = 0, c = 0, d = 0;  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    if (sscanf(server.arg(name).c_str(), "%d.%d.%d.%d", &a, &b, &c, &d) == 4)
    {
        out[0] = (uint8_t)clampInt(a, 0, 255);
        out[1] = (uint8_t)clampInt(b, 0, 255);
        out[2] = (uint8_t)clampInt(c, 0, 255);
        out[3] = (uint8_t)clampInt(d, 0, 255);
    }
}


//------------------------------------------------------------------------------
// Назначение функции: Принимает и разбирает входные данные, преобразуя их во внутренний формат.
// Локальные переменные:
// - b: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - c: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - d: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
//------------------------------------------------------------------------------
static void parseIpArgFromValue(const String& value, uint8_t out[4])
{
    if (out == nullptr) return;

    int a = 0, b = 0, c = 0, d = 0;  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    if (sscanf(value.c_str(), "%d.%d.%d.%d", &a, &b, &c, &d) == 4)
    {
        out[0] = (uint8_t)clampInt(a, 0, 255);
        out[1] = (uint8_t)clampInt(b, 0, 255);
        out[2] = (uint8_t)clampInt(c, 0, 255);
        out[3] = (uint8_t)clampInt(d, 0, 255);
    }
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные:
// - out: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
//------------------------------------------------------------------------------
static String jsonEscape(const String& src)
{
    String out;  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    out.reserve(src.length() + 8);
    for (size_t i = 0; i < src.length(); ++i)
    {
        const char c = src[i];  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
        if (c == '\\' || c == '"') out += '\\';
        if (c == '\r' || c == '\n') out += ' ';
        else out += c;
    }
    return out;
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static float distanceKm(float lat1, float lon1, float lat2, float lon2)
{
    const float DEG_TO_RAD_F = 0.017453292519943295769f;  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.
    const float R = 6371.0f;  // Служебная переменная, используемая для промежуточных вычислений и логики модуля.

