MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_Base/FlyRf_Base_26_04_22_11/WebRF.cpp
    return html;
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static String outputsSavedPage()
{
    String html = htmlBegin("&#1053;&#1086;&#1074;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072;");
    html += F("<h1>&#1053;&#1086;&#1074;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072;:</h1><table>");
    html += F("<tr><th>&#1042;&#1099;&#1074;&#1086;&#1076; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; Serial</th><td>"); html += serialModeName(settings ? settings->serial_out : OUTPUT_MODE_OFF); html += F("</td></tr>");
    html += F("<tr><th>&#1042;&#1099;&#1074;&#1086;&#1076; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; RS485</th><td>"); html += rs485ModeName(settings ? settings->rs485_out : OUTPUT_MODE_OFF); html += F("</td></tr>");
    html += F("<tr><th>NMEA output</th><td>"); html += nmeaName(settings ? settings->nmea_out : NMEA_OUTPUT_OFF); if (settings && settings->nmea_out == NMEA_OUTPUT_UDP) { html += F(" / port "); html += String(settings->udp_port ? settings->udp_port : WiFi_defaultNmeaUdpPort()); } html += F("</td></tr>");
    html += F("<tr><th>Bluetooth</th><td>"); html += bluetoothModeName(settings ? settings->bluetooth : BLUETOOTH_OFF); if (settings && settings->bluetooth == BLUETOOTH_LE) { html += F(" / "); html += Bluetooth_name(); } html += F("</td></tr>");
    html += F("</table><div class='hr'></div><div class='confirmTitle'>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1099; &#1073;&#1077;&#1079; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080;.</div><div class='btnRow'><a class='btn' href='/'><span class='btnIcon'>&#127968;</span>&#1053;&#1072; &#1075;&#1083;&#1072;&#1074;&#1085;&#1091;&#1102;</a></div></div></body></html>");
    return html;
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static String aboutPage()
{
    String html = htmlBegin("&#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;");
    html += F("<h1>&#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;</h1>");
    html += F("<div class='about'>== &#1069;&#1090;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1095;&#1072;&#1089;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; FlyRF ==<br>");
    html += F("== &#1041;&#1072;&#1079;&#1086;&#1074;&#1099;&#1081; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; ==<br>");
    html += F("&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1072; &#1089; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084;<br>");
    html += F("&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1083;&#1083;&#1077;&#1082;&#1090;&#1072;<br><br>");
    html += F("URL: https://www.decima.ru/contacts/<br>");
    html += F("E-mail: decima@decima.ru</div><div class='hr'></div>");
    html += F("<div class='about' style='text-align:center'>Copyright (C) 2023-2026&nbsp;&nbsp;&nbsp; &#1054;&#1054;&#1054; &#1044;&#1077;&#1094;&#1080;&#1084;&#1072;</div>");
    html += F("</div></body></html>");
    return html;
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные:
// - f: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
// - file: Служебная переменная, используемая для промежуточных вычислений и логики модуля.
//------------------------------------------------------------------------------
static String firmwarePage()
{
    String html = htmlBegin("&#1054;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;");
    html += F("<h1>&#1054;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;</h1>");
    html += F("<div class='confirmTitle'>&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; BIN-&#1092;&#1072;&#1081;&#1083; &#1087;&#1088;&#1086;&#1096;&#1080;&#1074;&#1082;&#1080; &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;.</div>");
    html += F("<form id='upload_form' method='POST' action='/update' enctype='multipart/form-data'>");
    html += F("<input id='fwFile' name='update' type='file' accept='.bin,application/octet-stream' hidden>");
    html += F("<div class='btnRow' style='margin-top:14px'><button class='btn' type='button' id='pickBtn'><span class='btnIcon'>&#128193;</span>&#1042;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083;</button></div>");
    html += F("<div id='fwName' class='confirmTitle' style='font-size:20px;margin-top:8px'>&#1060;&#1072;&#1081;&#1083; &#1085;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;</div>");
    html += F("<div class='btnRow'><button class='btn' type='submit' id='fwBtn'><span class='btnIcon'>&#11014;</span>&#1054;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091;</button></div>");
    html += F("</form>");
    html += F("<div class='progressWrap'><div id='bar' class='progressBar'></div></div>");
    html += F("<div id='prg' class='confirmTitle' style='font-size:20px'>&#1055;&#1088;&#1086;&#1075;&#1088;&#1077;&#1089;&#1089;: 0%</div>");
    html += F("<div id='st' class='confirmTitle' style='font-size:18px'>&#1043;&#1086;&#1090;&#1086;&#1074; &#1082; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1077;</div>");
    html += F("<div class='btnRow'><a class='btn' href='/'><span class='btnIcon'>&#127968;</span>&#1042;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1075;&#1083;&#1072;&#1074;&#1085;&#1091;&#1102;</a></div>");
    html += F(R"rawliteral(
<script>
(function(){
  var form=document.getElementById('upload_form');
  var fileEl=document.getElementById('fwFile');
  var pickBtn=document.getElementById('pickBtn');
  var btn=document.getElementById('fwBtn');
  var nameEl=document.getElementById('fwName');
  var prg=document.getElementById('prg');
  var st=document.getElementById('st');
  var bar=document.getElementById('bar');
  function setProgress(p){
    if(!isFinite(p)) p=0;
    if(p<0) p=0; if(p>100) p=100;
    bar.style.width=p+'%';
    prg.innerHTML='&#1055;&#1088;&#1086;&#1075;&#1088;&#1077;&#1089;&#1089;: '+p+'%';
  }
  function decodeHtml(t){ var e=document.createElement('textarea'); e.innerHTML=String(t||''); return e.value; }
  function setStatus(t){ st.textContent=decodeHtml(t); }
  function setBusy(b){ btn.disabled=b; pickBtn.disabled=b; }
  function showFile(){
    if(fileEl.files && fileEl.files.length){
      var f=fileEl.files[0];
      nameEl.innerHTML='&#1060;&#1072;&#1081;&#1083;: '+f.name+'<br>(' + f.size + ' &#1073;&#1072;&#1081;&#1090;)';
      setStatus('&#1060;&#1072;&#1081;&#1083; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;');
    } else {
      nameEl.innerHTML='&#1060;&#1072;&#1081;&#1083; &#1085;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;';
      setStatus('&#1043;&#1086;&#1090;&#1086;&#1074; &#1082; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1077;');
    }
  }
  pickBtn.addEventListener('click', function(){ fileEl.click(); });
  fileEl.addEventListener('change', showFile);
  form.addEventListener('submit', function(e){
    e.preventDefault();
    if(!fileEl.files || !fileEl.files.length){ setStatus('&#1057;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; BIN-&#1092;&#1072;&#1081;&#1083;'); return; }
    var file=fileEl.files[0];
    if(!/\.bin$/i.test(file.name)){ setStatus('&#1053;&#1091;&#1078;&#1077;&#1085; &#1092;&#1072;&#1081;&#1083; &#1087;&#1088;&#1086;&#1096;&#1080;&#1074;&#1082;&#1080; .bin'); return; }
    var data=new FormData(form);
    setBusy(true);
    setProgress(0);
    setStatus('&#1048;&#1076;&#1105;&#1090; &#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1086;&#1074;&#1082;&#1072; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080;...');
    var xhr=new XMLHttpRequest();
    xhr.open('POST','/update',true);
    xhr.timeout=240000;
    xhr.upload.addEventListener('progress', function(evt){
      if(evt.lengthComputable && evt.total>0){
        var per=Math.round((evt.loaded*100)/evt.total);
        setProgress(per);
        setStatus('&#1055;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1072; &#1092;&#1072;&#1081;&#1083;&#1072; &#1085;&#1072; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086;...');
      }
    }, false);
    xhr.onload=function(){
      setBusy(false);
      if(xhr.status===200){
        var txt=(xhr.responseText||'').trim();
        if(txt==='OK'){
          setProgress(100);
          setStatus('&#1054;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1086;. &#1055;&#1077;&#1088;&#1077;&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072;...');
        } else {
          setStatus(txt || '&#1054;&#1096;&#1080;&#1073;&#1082;&#1072; &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;');
        }
      } else {
        setStatus('HTTP '+xhr.status);
      }
    };
    xhr.onerror=function(){ setBusy(false); setStatus('&#1054;&#1096;&#1080;&#1073;&#1082;&#1072; &#1089;&#1077;&#1090;&#1080; &#1087;&#1088;&#1080; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1077;'); };
    xhr.onabort=function(){ setBusy(false); setStatus('&#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1086;&#1090;&#1084;&#1077;&#1085;&#1077;&#1085;&#1072;'); };
    xhr.ontimeout=function(){ setBusy(false); setStatus('&#1058;&#1072;&#1081;&#1084;-&#1072;&#1091;&#1090; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080;'); };
    xhr.send(data);
  });
})();
