MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_Base/FlyRf_Base_26_04_22_11/WebRF.cpp
        char icaoBuf[16];
        snprintf(icaoBuf, sizeof(icaoBuf), "%06lX", (unsigned long)list[i].icao);

        float distKm = 0.0f;
        if ((fabsf(list[i].lat) > 0.00001f || fabsf(list[i].lon) > 0.00001f) &&
            (fabsf(rxLat) > 0.00001f || fabsf(rxLon) > 0.00001f))
        {
            distKm = distanceKm(rxLat, rxLon, list[i].lat, list[i].lon);
        }

        json += '{';
        json += "\"icao\":\""; json += icaoBuf; json += "\",";
        json += "\"source\":\""; json += sourceName(list[i].source); json += "\",";
        json += "\"distance_km\":"; json += String(distKm, 2); json += ',';
        json += "\"lat\":"; json += String(list[i].lat, 5); json += ',';
        json += "\"lon\":"; json += String(list[i].lon, 5); json += ',';
        json += "\"altitude\":"; json += String(list[i].altitude); json += ',';
        json += "\"speed\":"; json += String(list[i].speed, 1); json += ',';
        json += "\"course\":"; json += String(list[i].course, 1); json += ',';
        json += "\"rssi\":"; json += String(list[i].rssi); json += ',';
        json += "\"snr\":"; json += String(list[i].snr, 1); json += ',';
        json += "\"age_ms\":"; json += String((uint32_t)(nowMs - list[i].lastUpdate));
        json += '}';
    }
    json += "]}";

    sendNoCache();
    server.send(200, "application/json; charset=utf-8", json);
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static void handleRoot() { sendPage(rootPage()); }
//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static void handleSettings() { sendPage(settingsPage()); }
//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static void handleHardwareSettings() { sendPage(hardwarePage()); }
//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static void handleOutputs() { sendPage(outputsPage()); }
//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static void handleAbout() { sendPage(aboutPage()); }
//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static void handleFirmware() { sendPage(firmwarePage()); }
//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static void handleMonitor() { sendPage(monitorPage()); }

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static void handleInput()
{
    if (settings)
    {
        if (server.hasArg("tracker_send")) settings->tracker_send = (uint8_t)clampInt(server.arg("tracker_send").toInt(), 0, 15);
        if (server.hasArg("mode")) settings->mode = (uint8_t)clampInt(server.arg("mode").toInt(), FLYRF_MODE_NORMAL, FLYRF_MODE_TXRX_TEST_MAX);
        if (server.hasArg("input_N_S")) settings->input_N_S = (uint8_t)clampInt(server.arg("input_N_S").toInt(), 0, 1);
        if (server.hasArg("local_latitude")) settings->local_latitude = server.arg("local_latitude").toFloat();
        if (server.hasArg("input_E_W")) settings->input_E_W = (uint8_t)clampInt(server.arg("input_E_W").toInt(), 0, 1);
        if (server.hasArg("local_longitude")) settings->local_longitude = server.arg("local_longitude").toFloat();
        applyRuntimeLocalCoordinates();
        EEPROM_store();
    }
    sendPage(settingsSavedPage());
}

//------------------------------------------------------------------------------
// Назначение функции: Выполняет отдельную законченную операцию внутри модуля и используется в общей логике проекта.
// Локальные переменные: функция использует в основном параметры, глобальные объекты или выраженные локальные данные не требуются.
//------------------------------------------------------------------------------
static void handleDisplayModeLive()
{
    if (!settings || !server.hasArg("display_set"))
    {
        sendNoCache();
        server.send(400, "application/json; charset=utf-8", "{\"ok\":false,\"message\":\"display_set not specified\"}");
        return;
    }

    settings->display_set = (uint8_t)clampInt(server.arg("display_set").toInt(), INFO_DISTLAY_OFF, INFO_DISPLAY_LORA_RAW);
    EEPROM_store();

